README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Data and Analysis for "The Quick and the Dead"</title>
<!-- 2016-11-27 Sun 14:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Colin S Maxwell and Paul M Magwene" />
</head>
<body>
<div id="content">
<h1 class="title">Data and Analysis for "The Quick and the Dead"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Requirements</a></li>
<li><a href="#sec-3">3. Files in this submission</a>
<ul>
<li><a href="#sec-3-1">3.1. 2016-Maxwell-Magwene-100genomes-temperature-growth.csv</a></li>
<li><a href="#sec-3-2">3.2. 2016-Maxwell-Magwene-100genomes-temperatures-raw.csv</a></li>
<li><a href="#sec-3-3">3.3. 2016-Maxwell-Magwene-mito-morphology-scoring.csv</a></li>
<li><a href="#sec-3-4">3.4. 2016-Maxwell-Magwene-mito-trackscar.csv</a></li>
<li><a href="#sec-3-5">3.5. 2016-Maxwell-Magwene-three-color-trackscar.csv</a></li>
<li><a href="#sec-3-6">3.6. 2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv</a></li>
<li><a href="#sec-3-7">3.7. 2016-Maxwell-Magwene-two-color-trackscar.csv</a></li>
<li><a href="#sec-3-8">3.8. 2016-Maxwell-Magwene-heat-stress-candidates.csv</a></li>
<li><a href="#sec-3-9">3.9. 2016-Maxwell-Magwene-PMY-to-YJM.csv</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Scripts used to generate the data files</a></li>
<li><a href="#sec-5">5. Miscellaneous code</a></li>
<li><a href="#sec-6">6. Scripts used to create shared data sets</a></li>
<li><a href="#sec-7">7. Scripts used to generate figures</a></li>
<li><a href="#sec-8">8. Statistics for Results</a>
<ul>
<li><a href="#sec-8-1">8.1. Increased mortality explains slow population growth for some heat sensitive strains</a></li>
<li><a href="#sec-8-2">8.2. Fecundity can be positively or negatively associated with age during stress</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. Linear model fecundity p-values</a></li>
<li><a href="#sec-8-2-2">8.2.2. Linear model fecundity slopes</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. Heat stress can cause premature senescence or early life mortality</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1. Probability of death with age in YJM693</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">9. Statistics for Supplementary results</a>
<ul>
<li><a href="#sec-9-1">9.1. Trackscar minimally affects cellular physiology</a></li>
<li><a href="#sec-9-2">9.2. TrackScar provides a sensitive measure of differences in fecundity</a></li>
<li><a href="#sec-9-3">9.3. Population Growth Rate and Mean Fecundity Are Well Correlated</a></li>
<li><a href="#sec-9-4">9.4. Heat stress can alter the distribution of ages in a population</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Session Info</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the data submitted to the Dryad repository for
the paper "The Quick and the Dead: Microbial Demography at the Yeast
Thermal Limit" and provides links to the code (or the code itself)
used to generate figures and the statistical analysis in the
paper. This document is written in <a href="http:orgmode.org">org-mode</a> format, and is best viewed
using emacs&#x2013;an open-source text editor. If this document is viewed on
github, links don't necessarily point to the correct sections, and the
results of source blocks (see below) are not displayed. If you want to
look at this document in a web-browser, we recommend cloning the repo
and examining <a href="README.html">this HTML</a> document that was exported from org-mode instead.
</p>

<p>
The scripts used to produce the figures are stand-alone files linked
to in the section <a href="#figs">Scripts used to generate figures</a>.
</p>

<p>
This code is also hosted on <a href="https://github.com/magwenelab/trackscar-dryad">github</a>.
</p>

<p>
Statistics referenced in the text are listed in the sections
<a href="#results">Statistics for Results</a> and <a href="#supp">Statistics for Supplementary Results</a>. The
code used to generate the statistics is shown in <a href="http://orgmode.org/worg/org-contrib/babel/">org-babel</a> format, and
can be run in situ in emacs. The results of each code block is shown
below it, giving the statistic of interest.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
The analysis is written in the R programming language. See the section
<a href="#session">Session Info</a> for the version of R and the packages used to run these
analyses. The scripts assume that all data data and scripts are in the
same folder.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Files in this submission</h2>
<div class="outline-text-2" id="text-3">
<p>
This section contains a list of the data files included in this
submission and gives:
</p>

<ol class="org-ol">
<li>A brief description of how the data were generated
</li>
<li>The name of the script (if any) that produced the data
</li>
<li>A description of the column names in the data
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 2016-Maxwell-Magwene-100genomes-temperature-growth.csv</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is a summary file that gives estimates of the maximum population
growth rate of a strain for several replicates and several
temperatures. This file was generated by <a href="process-growth-curves.R">process-growth-curves.R</a>,
which processes the raw data that is summarized in
<a href="2016-Maxwell-Magwene-100genomes-temperatures-raw.csv">2016-Maxwell-Magwene-100genomes-temperatures-raw.csv</a>.
</p>

<hr  />

<dl class="org-dl">
<dt> fn </dt><dd>This gives the path to the raw data file used to generate the
estimate
</dd>
<dt> temp </dt><dd>The temperature that the growth curve was collected at
</dd>
<dt> rep </dt><dd>The replicate number of the temperature
</dd>
<dt> row </dt><dd>The row that the well was in
</dd>
<dt> col </dt><dd>The column that the well was in
</dd>
<dt> Strain </dt><dd>The YJM number of the strain. YJM stands for 'Yeast John
McCusker'. These are the original stocks for the 100 genomes
collection used throughout these experiments that the PMY numbers
are derived from
</dd>
<dt> PMY </dt><dd>The PMY number of the strain. PMY stands for 'Paul Magwene
Yeast'. These are the actual stocks used during these experiments.
</dd>
<dt> maxGrowth </dt><dd>The estimate of maximum population growth for that
strain and temperature, given in OD/sec
</dd>
<dt> pointOfMaxGrowthRate </dt><dd>The time point at which the maximum OD was
reached
</dd>
<dt> maxOD </dt><dd>The maximum OD that was reached during the experiment
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 2016-Maxwell-Magwene-100genomes-temperatures-raw.csv</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This file contains the raw OD measurements from the Tecan Sunrise
plate reader. The Tecan exports data in a form that is difficult to
analyze, so rather than including the raw .asc files, the data was
read in and aggregated by the script <a href="process-growth-curves.R">process-growth-curves.R</a>. To
get the actual raw data in the script, please email the corresponding
author of the paper.
</p>

<hr  />

<dl class="org-dl">
<dt> YJM </dt><dd>The YJM number of the strain. YJM stands for 'Yeast John
McCusker'. These are the original stocks for the 100 genomes
collection used throughout these experiments that the PMY numbers
are derived from
</dd>
<dt> PMY </dt><dd>The PMY number of the strain. PMY stands for 'Paul Magwene
Yeast'. These are the actual stocks used during these experiments.
</dd>
<dt> filename </dt><dd>The path to the original raw data file
</dd>
<dt> platemap </dt><dd>The path to the original plate map file.
</dd>
<dt> replicate </dt><dd>The replicate number of the temperature
</dd>
<dt> temperature </dt><dd>The temperature the growth curve was collected at
</dd>
<dt> row </dt><dd>The row in the plate
</dd>
<dt> col </dt><dd>The column in the plate
</dd>
<dt> seconds </dt><dd>The number of seconds elapsed since the start of the experiment
</dd>
<dt> OD </dt><dd>The optical density in the well
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 2016-Maxwell-Magwene-mito-morphology-scoring.csv</h3>
<div class="outline-text-3" id="text-3-3">
<p>
These data were collected by manually scoring the mitochondrial
morphology of strains containing a mitochondrially localized GFP at
both 30C and 35.5C in 'real time' (no images collected) in an Axio Imager.
</p>

<p>
See volume 5 pgs 12 and 14 of Colin Maxwell's lab notebook for the raw
data.
</p>

<hr  />

<dl class="org-dl">
<dt> strain </dt><dd>The CMY number of the strain. CMY stands for Colin Maxwell
Yeast. see Table S1 for a mapping to the PMY number and genotype
of the strain.
</dd>
<dt> temp </dt><dd>The temperature that the data were collected at
</dd>
<dt> rep </dt><dd>The replicate number of the data
</dd>
<dt> A<sub>threads</sub> </dt><dd>"A" is the original scoring code. "threads" is the
morphology category.
</dd>
<dt> C<sub>clumps</sub> </dt><dd>"C" is the original scoring code. "clumps" is the
morphology category; only clumpy mitochondria present.
</dd>
<dt> B<sub>clumps</sub>-threads </dt><dd>"B" is the original scoring 
code. "clumps-threads" is the morphology category; both clumps
and threads present.
</dd>
<dt> D<sub>no</sub>-mitos </dt><dd>"D" is the original scoring code. "no-mitos" is the
morphology category; no mitochondria were observed.
</dd>
</dl>
</div>
</div>
