README.org
** 2016-Maxwell-Magwene-mito-trackscar.csv

This contains data about the morphology and fecundity of several
strains of yeast at both 30C and 35.5C. These data were collected
using the DeltaVision and then scoring the morphology and counting the
budscars based on the resulting images. The file was generated from
the original count data files from the script
[[file:process-mito-trackscar-data.R]]. To get the actual raw data in the
script, please email the corresponding author of the paper.

------------------------------------------------------------

+ folder :: The name of the folder containing the original data
+ experiment_ID	:: The experiment ID of the data
+ counts_file :: The name of the file containing the original data
+ sampling :: The method of sampling used -- either "random" or
     "for_age". "Random" means the cells were imaged by moving in a
     transect along the slide and imaging each cell that was positive
     for the first stain. "for_age" means that older cells were sought
     out specifically. 
+ temp :: The temperature that the data was collected at.
+ media :: The media that the cells were grown in 
+ who_counted :: Who counted the buds (CSM = Colin S. Maxwell)
+ number_of_colors :: Either "2" or "3" color TrackScar
+ time :: Hours between stains
+ strain :: CMY (Colin Maxwell Yeast) number and the temperature. See
     Table S1 for a mapping from CMY numbers to other data.
+ growth :: Number of new scars produced during the experiment (should
     be called 'fecundity', but is called 'growth' for historical
     reasons). growth = second - first
+ first	:: Number of scars stained with the first stain
+ second :: The number of scars stained with the second stain.
+ mitos :: The mito morphology class of the cell: 't' = threads; 'c' =
     clumps; 'tc' = thread & clumps; 'n' = no mitochondria.

** 2016-Maxwell-Magwene-three-color-trackscar.csv

This contains the data for the three color trackscar experiments that
were analyzed during the experiment. The original design of these
experiments let recover after heat stress at either 30C or 37C for
either 3 or 6 hrs. The 3hr recovery data was not used in the paper and
is not included in this file. The 37C recovery data is only used for
its first interval as a two color TrackScar experiment. This file was
generated from the original count data files by the script
[[file:process-three-color-trackscar.R]]. To get the actual raw data in
the script, please email the corresponding author of the paper.

------------------------------------------------------------

- folder :: The name of the folder containing the original data
- counts_file :: The name of the file containing the original data
- experiment :: The experiment ID of the data
- sampling :: The method of sampling used -- either "random" or
     "for_age". "Random" means the cells were imaged by moving in a
     transect along the slide and imaging each cell that was positive
     for the first stain. "for_age" means that older cells were sought
     out specifically.
- who_counted :: Who counted the buds (CSM = Colin S. Maxwell)
- temp :: The temperature that the data was collected at.
- strain :: The PMY (Paul Magwene Yeast) number of the strain. For a
     mapping to YJM numbers reported in the text, see the file
     [[file:PMY_to_YJM.csv]].
- growth :: Number of new scars produced during the experiment (should
     be called 'fecundity', but is called 'growth' for historical
     reasons). growth = last - first
- growth1 :: Number of buds between the first and second stain
- growth2 :: Number of buds between the second and third stain
- first :: Number of scars stained with the first stain
- last :: Number of scars stained with the third stain
- recoveryTemp :: The temperature the cells were incubated in during
     the recovery period
- recoveryTime :: The length of time the cells were incubated during
     the recovery period.

** 2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv

This data is two color TrackScar experiments where the time between
the first and the second stain varied between one and six hours. The
file was created by the script [[file:process-two-color-trackscar.R]]. To
get the actual raw data in the script, please email the corresponding
author of the paper.

------------------------------------------------------------

- folder :: The name of the folder containing the original data
- experiment_ID	::  The experiment ID of the data
- counts_file :: The name of the file containing the original data
- sampling :: The method of sampling used -- either "random" or
     "for_age". "Random" means the cells were imaged by moving in a
     transect along the slide and imaging each cell that was positive
     for the first stain. "for_age" means that older cells were sought
     out specifically.
- temp :: The temperature that the data was collected at.
- media :: The media that the cells were grown in 
- who_counted :: Who counted the buds (CSM = Colin S. Maxwell)
- number_of_colors ::  Either "2" or "3" color TrackScar
- time :: How many hours between the first and second strains
- strain :: The YJM number of the strain. YJM stands for 'Yeast John
     McCusker'. These are the original stocks for the 100 genomes
     collection used throughout these experiments that the PMY numbers
     are derived from
- replicate :: Replicate number
- growth :: Number of new scars produced during the experiment (should
     be called 'fecundity', but is called 'growth' for historical
     reasons). growth = second - first
- first	:: Number of scars stained with the first stain
- last :: The number of scars stained with the second stain.

