README.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 2016-Maxwell-Magwene-mito-trackscar.csv</h3>
<div class="outline-text-3" id="text-3-4">
<p>
This contains data about the morphology and fecundity of several
strains of yeast at both 30C and 35.5C. These data were collected
using the DeltaVision and then scoring the morphology and counting the
budscars based on the resulting images. The file was generated from
the original count data files from the script
<a href="process-mito-trackscar-data.R">process-mito-trackscar-data.R</a>. To get the actual raw data in the
script, please email the corresponding author of the paper.
</p>

<hr  />

<dl class="org-dl">
<dt> folder </dt><dd>The name of the folder containing the original data
</dd>
<dt> experiment<sub>ID</sub> </dt><dd>The experiment ID of the data
</dd>
<dt> counts<sub>file</sub> </dt><dd>The name of the file containing the original data
</dd>
<dt> sampling </dt><dd>The method of sampling used &#x2013; either "random" or
"for<sub>age</sub>". "Random" means the cells were imaged by moving in a
transect along the slide and imaging each cell that was positive
for the first stain. "for<sub>age</sub>" means that older cells were sought
out specifically. 
</dd>
<dt> temp </dt><dd>The temperature that the data was collected at.
</dd>
<dt> media </dt><dd>The media that the cells were grown in 
</dd>
<dt> who<sub>counted</sub> </dt><dd>Who counted the buds (CSM = Colin S. Maxwell)
</dd>
<dt> number<sub>of</sub><sub>colors</sub> </dt><dd>Either "2" or "3" color TrackScar
</dd>
<dt> time </dt><dd>Hours between stains
</dd>
<dt> strain </dt><dd>CMY (Colin Maxwell Yeast) number and the temperature. See
Table S1 for a mapping from CMY numbers to other data.
</dd>
<dt> growth </dt><dd>Number of new scars produced during the experiment (should
be called 'fecundity', but is called 'growth' for historical
reasons). growth = second - first
</dd>
<dt> first </dt><dd>Number of scars stained with the first stain
</dd>
<dt> second </dt><dd>The number of scars stained with the second stain.
</dd>
<dt> mitos </dt><dd>The mito morphology class of the cell: 't' = threads; 'c' =
clumps; 'tc' = thread &amp; clumps; 'n' = no mitochondria.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 2016-Maxwell-Magwene-three-color-trackscar.csv</h3>
<div class="outline-text-3" id="text-3-5">
<p>
This contains the data for the three color trackscar experiments that
were analyzed during the experiment. The original design of these
experiments let recover after heat stress at either 30C or 37C for
either 3 or 6 hrs. The 3hr recovery data was not used in the paper and
is not included in this file. The 37C recovery data is only used for
its first interval as a two color TrackScar experiment. This file was
generated from the original count data files by the script
<a href="process-three-color-trackscar.R">process-three-color-trackscar.R</a>. To get the actual raw data in
the script, please email the corresponding author of the paper.
</p>

<hr  />

<dl class="org-dl">
<dt> folder </dt><dd>The name of the folder containing the original data
</dd>
<dt> counts<sub>file</sub> </dt><dd>The name of the file containing the original data
</dd>
<dt> experiment </dt><dd>The experiment ID of the data
</dd>
<dt> sampling </dt><dd>The method of sampling used &#x2013; either "random" or
"for<sub>age</sub>". "Random" means the cells were imaged by moving in a
transect along the slide and imaging each cell that was positive
for the first stain. "for<sub>age</sub>" means that older cells were sought
out specifically.
</dd>
<dt> who<sub>counted</sub> </dt><dd>Who counted the buds (CSM = Colin S. Maxwell)
</dd>
<dt> temp </dt><dd>The temperature that the data was collected at.
</dd>
<dt> strain </dt><dd>The PMY (Paul Magwene Yeast) number of the strain. For a
mapping to YJM numbers reported in the text, see the file
<a href="PMY_to_YJM.csv">PMY_to_YJM.csv</a>.
</dd>
<dt> growth </dt><dd>Number of new scars produced during the experiment (should
be called 'fecundity', but is called 'growth' for historical
reasons). growth = last - first
</dd>
<dt> growth1 </dt><dd>Number of buds between the first and second stain
</dd>
<dt> growth2 </dt><dd>Number of buds between the second and third stain
</dd>
<dt> first </dt><dd>Number of scars stained with the first stain
</dd>
<dt> last </dt><dd>Number of scars stained with the third stain
</dd>
<dt> recoveryTemp </dt><dd>The temperature the cells were incubated in during
the recovery period
</dd>
<dt> recoveryTime </dt><dd>The length of time the cells were incubated during
the recovery period.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv</h3>
<div class="outline-text-3" id="text-3-6">
<p>
This data is two color TrackScar experiments where the time between
the first and the second stain varied between one and six hours. The
file was created by the script <a href="process-two-color-trackscar.R">process-two-color-trackscar.R</a>. To
get the actual raw data in the script, please email the corresponding
author of the paper.
</p>

<hr  />

<dl class="org-dl">
<dt> folder </dt><dd>The name of the folder containing the original data
</dd>
<dt> experiment<sub>ID</sub> </dt><dd>The experiment ID of the data
</dd>
<dt> counts<sub>file</sub> </dt><dd>The name of the file containing the original data
</dd>
<dt> sampling </dt><dd>The method of sampling used &#x2013; either "random" or
"for<sub>age</sub>". "Random" means the cells were imaged by moving in a
transect along the slide and imaging each cell that was positive
for the first stain. "for<sub>age</sub>" means that older cells were sought
out specifically.
</dd>
<dt> temp </dt><dd>The temperature that the data was collected at.
</dd>
<dt> media </dt><dd>The media that the cells were grown in 
</dd>
<dt> who<sub>counted</sub> </dt><dd>Who counted the buds (CSM = Colin S. Maxwell)
</dd>
<dt> number<sub>of</sub><sub>colors</sub> </dt><dd>Either "2" or "3" color TrackScar
</dd>
<dt> time </dt><dd>How many hours between the first and second strains
</dd>
<dt> strain </dt><dd>The YJM number of the strain. YJM stands for 'Yeast John
McCusker'. These are the original stocks for the 100 genomes
collection used throughout these experiments that the PMY numbers
are derived from
</dd>
<dt> replicate </dt><dd>Replicate number
</dd>
<dt> growth </dt><dd>Number of new scars produced during the experiment (should
be called 'fecundity', but is called 'growth' for historical
reasons). growth = second - first
</dd>
<dt> first </dt><dd>Number of scars stained with the first stain
</dd>
<dt> last </dt><dd>The number of scars stained with the second stain.
</dd>
</dl>
</div>
</div>
