README.org
** 2016-Maxwell-Magwene-two-color-trackscar.csv

These data are two color TrackScar experiments where the time between
the first and the second stain is six hours. The file was created by
the script [[file:process-two-color-trackscar.R]]. To get the actual raw
data in the script, please email the corresponding author of the
paper.

------------------------------------------------------------

- folder :: The name of the folder containing the original data
- experiment_ID	::  The experiment ID of the data
- counts_file :: The name of the file containing the original data
- sampling :: The method of sampling used -- either "random" or
     "for_age". "Random" means the cells were imaged by moving in a
     transect along the slide and imaging each cell that was positive
     for the first stain. "for_age" means that older cells were sought
     out specifically.
- temp :: The temperature that the data was collected at.
- media :: The media that the cells were grown in 
- who_counted :: Who counted the buds (CSM = Colin S. Maxwell)
- number_of_colors ::  Either "2" or "3" color TrackScar
- time :: How many hours between the first and second strains
- strain :: The PMY (Paul Magwene Yeast) number of the strain. For a
     mapping to YJM numbers reported in the text, see the file
     [[file:PMY_to_YJM.csv]].
- replicate :: Replicate number
- growth :: Number of new scars produced during the experiment (should
     be called 'fecundity', but is called 'growth' for historical
     reasons). growth = second - first
- first	:: Number of scars stained with the first stain
- last :: The number of scars stained with the second stain.

** 2016-Maxwell-Magwene-heat-stress-candidates.csv

This is a file that gives a list of the strains sensitive to growth at
35.5C that were examined using TrackScar. The file was originally
produced by the script [[file:analyze-growth-curves.R]], but the name was
changed and was annotated when it became apparent that some strains
couldn't be analyzed using TrackScar. 

------------------------------------------------------------

- PMY :: The PMY (Paul Magwene Yeast) number of the strain. For a
     mapping to YJM numbers reported in the text, see the file
     [[file:PMY_to_YJM.csv]].
- ratioMaxGrowth :: Growth at 35.5C/30C
- maxGrowth30C :: Growth rate at 30C
- maxGrowth35halfC :: Growth rate at 35.5C
- maxGrowth37C :: Growth rate at 37C
- exclusion_reason :: If it was excluded from subsequent analysis, why?

** 2016-Maxwell-Magwene-PMY-to-YJM.csv

 This is a mapping between the 100 genomes PMY (Paul Magwene Yeast)
 numbers and YJM (Yeast John McCusker) numbers.

 ------------------------------------------------------------

 - PMY :: The PMY number
 - Strain :: The YJM number

* Scripts used to generate the data files

All scripts that begin with the name 'process' were run to generate
data for the Dryad submission using files that will not be submitted
to Dryad. The scripts filter data to contain only the data needed in
the paper and annotate it with the appropriate metadata. Since these
scripts rely on unsubmitted data, they cannot be run but are submitted
to allow the data processing steps to be examined. See above for which
scripts generated which files.

Each script dealing with TrackScar data includes a line that subtracts
1.5C from the temperature of TrackScar data above 30C. This is because
the incubator that the TrackScar data was collected in was found to be
too high for these temperatures. To keep consistent, the data was
annotated with the incubator's temperature, but it is corrected here
for the ease of subsequent interpretation.

------------------------------------------------------------

- [[file:process-growth-curves.R]]
- [[file:process-mito-trackscar-data.R]]
- [[file:process-two-color-trackscar.R]]
- [[file:process-three-color-trackscar.R]]

* Miscellaneous code

- [[file:budscar-count-utilities.R]] :: Miscellaneous files for handling
     trackscar data
- [[file:fig-theme.R]] :: A ggplot2 theme used in the figures
- [[file:load-libraries.R]] :: Loads all the libraries used in the analysis
- [[file:tecan.R]] :: Functions to deal with the awful ASCII export from a
     Tecan Sunrise.

* Scripts used to create shared data sets

All scripts that begin with the name 'analyze' are used to process
data in a way that gets reused across multiple figures or code
blocks. They will all run as self-contained scripts, but most don't
generate  output, they just make certain datasets available.

------------------------------------------------------------

- [[file:analyze-growth-curves.R]]
- [[file:analyze-linear-models.R]]
- [[file:analyze-S288C-trackscar.R]]
- [[file:analyze-three-color-trackscar.R]]
- [[file:analyze-two-color-trackscar.R]]

* <<figs>> Scripts used to generate figures

Each figure panel that contains data was generated using the code
contained in the scripts below.

------------------------------------------------------------


- [[file:generate-figures.R]] :: this is just a convenience script that
     runs all the scripts below
- [[file:figure-2.R]] ::
- [[file:figure-3.R]] ::
- [[file:figure-4.R]] ::
- [[file:figure-5.R]] ::
- [[file:figure-6.R]] ::
- [[file:figure-S1.R]] ::
- [[file:figure-S2.R]] ::
- [[file:figure-S3.R]] ::
- [[file:figure-S4.R]] ::
- [[file:figure-S5.R]] ::
- [[file:figure-S6.R]] ::
- [[file:figure-S7.R]] ::

* <<results>> Statistics for Results

The following code blocks justify the statistics cited in the main text.

