README.html

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 2016-Maxwell-Magwene-two-color-trackscar.csv</h3>
<div class="outline-text-3" id="text-3-7">
<p>
These data are two color TrackScar experiments where the time between
the first and the second stain is six hours. The file was created by
the script <a href="process-two-color-trackscar.R">process-two-color-trackscar.R</a>. To get the actual raw
data in the script, please email the corresponding author of the
paper.
</p>

<hr  />

<dl class="org-dl">
<dt> folder </dt><dd>The name of the folder containing the original data
</dd>
<dt> experiment<sub>ID</sub> </dt><dd>The experiment ID of the data
</dd>
<dt> counts<sub>file</sub> </dt><dd>The name of the file containing the original data
</dd>
<dt> sampling </dt><dd>The method of sampling used &#x2013; either "random" or
"for<sub>age</sub>". "Random" means the cells were imaged by moving in a
transect along the slide and imaging each cell that was positive
for the first stain. "for<sub>age</sub>" means that older cells were sought
out specifically.
</dd>
<dt> temp </dt><dd>The temperature that the data was collected at.
</dd>
<dt> media </dt><dd>The media that the cells were grown in 
</dd>
<dt> who<sub>counted</sub> </dt><dd>Who counted the buds (CSM = Colin S. Maxwell)
</dd>
<dt> number<sub>of</sub><sub>colors</sub> </dt><dd>Either "2" or "3" color TrackScar
</dd>
<dt> time </dt><dd>How many hours between the first and second strains
</dd>
<dt> strain </dt><dd>The PMY (Paul Magwene Yeast) number of the strain. For a
mapping to YJM numbers reported in the text, see the file
<a href="PMY_to_YJM.csv">PMY_to_YJM.csv</a>.
</dd>
<dt> replicate </dt><dd>Replicate number
</dd>
<dt> growth </dt><dd>Number of new scars produced during the experiment (should
be called 'fecundity', but is called 'growth' for historical
reasons). growth = second - first
</dd>
<dt> first </dt><dd>Number of scars stained with the first stain
</dd>
<dt> last </dt><dd>The number of scars stained with the second stain.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 2016-Maxwell-Magwene-heat-stress-candidates.csv</h3>
<div class="outline-text-3" id="text-3-8">
<p>
This is a file that gives a list of the strains sensitive to growth at
35.5C that were examined using TrackScar. The file was originally
produced by the script <a href="analyze-growth-curves.R">analyze-growth-curves.R</a>, but the name was
changed and was annotated when it became apparent that some strains
couldn't be analyzed using TrackScar. 
</p>

<hr  />

<dl class="org-dl">
<dt> PMY </dt><dd>The PMY (Paul Magwene Yeast) number of the strain. For a
mapping to YJM numbers reported in the text, see the file
<a href="PMY_to_YJM.csv">PMY_to_YJM.csv</a>.
</dd>
<dt> ratioMaxGrowth </dt><dd>Growth at 35.5C/30C
</dd>
<dt> maxGrowth30C </dt><dd>Growth rate at 30C
</dd>
<dt> maxGrowth35halfC </dt><dd>Growth rate at 35.5C
</dd>
<dt> maxGrowth37C </dt><dd>Growth rate at 37C
</dd>
<dt> exclusion<sub>reason</sub> </dt><dd>If it was excluded from subsequent analysis, why?
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 2016-Maxwell-Magwene-PMY-to-YJM.csv</h3>
<div class="outline-text-3" id="text-3-9">
<p>
This is a mapping between the 100 genomes PMY (Paul Magwene Yeast)
numbers and YJM (Yeast John McCusker) numbers.
</p>

<hr  />

<dl class="org-dl">
<dt> PMY </dt><dd>The PMY number
</dd>
<dt> Strain </dt><dd>The YJM number
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Scripts used to generate the data files</h2>
<div class="outline-text-2" id="text-4">
<p>
All scripts that begin with the name 'process' were run to generate
data for the Dryad submission using files that will not be submitted
to Dryad. The scripts filter data to contain only the data needed in
the paper and annotate it with the appropriate metadata. Since these
scripts rely on unsubmitted data, they cannot be run but are submitted
to allow the data processing steps to be examined. See above for which
scripts generated which files.
</p>

<p>
Each script dealing with TrackScar data includes a line that subtracts
1.5C from the temperature of TrackScar data above 30C. This is because
the incubator that the TrackScar data was collected in was found to be
too high for these temperatures. To keep consistent, the data was
annotated with the incubator's temperature, but it is corrected here
for the ease of subsequent interpretation.
</p>

<hr  />

<ul class="org-ul">
<li><a href="process-growth-curves.R">process-growth-curves.R</a>
</li>
<li><a href="process-mito-trackscar-data.R">process-mito-trackscar-data.R</a>
</li>
<li><a href="process-two-color-trackscar.R">process-two-color-trackscar.R</a>
</li>
<li><a href="process-three-color-trackscar.R">process-three-color-trackscar.R</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Miscellaneous code</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt> <a href="budscar-count-utilities.R">budscar-count-utilities.R</a> </dt><dd>Miscellaneous files for handling
trackscar data
</dd>
<dt> <a href="fig-theme.R">fig-theme.R</a> </dt><dd>A ggplot2 theme used in the figures
</dd>
<dt> <a href="load-libraries.R">load-libraries.R</a> </dt><dd>Loads all the libraries used in the analysis
</dd>
<dt> <a href="tecan.R">tecan.R</a> </dt><dd>Functions to deal with the awful ASCII export from a
Tecan Sunrise.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Scripts used to create shared data sets</h2>
<div class="outline-text-2" id="text-6">
<p>
All scripts that begin with the name 'analyze' are used to process
data in a way that gets reused across multiple figures or code
blocks. They will all run as self-contained scripts, but most don't
generate  output, they just make certain datasets available.
</p>

<hr  />

<ul class="org-ul">
<li><a href="analyze-growth-curves.R">analyze-growth-curves.R</a>
</li>
<li><a href="analyze-linear-models.R">analyze-linear-models.R</a>
</li>
<li><a href="analyze-S288C-trackscar.R">analyze-S288C-trackscar.R</a>
</li>
<li><a href="analyze-three-color-trackscar.R">analyze-three-color-trackscar.R</a>
</li>
<li><a href="analyze-two-color-trackscar.R">analyze-two-color-trackscar.R</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a id="figs" name="figs"></a> Scripts used to generate figures</h2>
<div class="outline-text-2" id="text-7">
<p>
Each figure panel that contains data was generated using the code
contained in the scripts below.
</p>

<hr  />


<dl class="org-dl">
<dt> <a href="generate-figures.R">generate-figures.R</a> </dt><dd>this is just a convenience script that
runs all the scripts below
</dd>
<dt> <a href="figure-2.R">figure-2.R</a> </dt><dd></dd>
<dt> <a href="figure-3.R">figure-3.R</a> </dt><dd></dd>
<dt> <a href="figure-4.R">figure-4.R</a> </dt><dd></dd>
<dt> <a href="figure-5.R">figure-5.R</a> </dt><dd></dd>
<dt> <a href="figure-6.R">figure-6.R</a> </dt><dd></dd>
<dt> <a href="figure-S1.R">figure-S1.R</a> </dt><dd></dd>
<dt> <a href="figure-S2.R">figure-S2.R</a> </dt><dd></dd>
<dt> <a href="figure-S3.R">figure-S3.R</a> </dt><dd></dd>
<dt> <a href="figure-S4.R">figure-S4.R</a> </dt><dd></dd>
<dt> <a href="figure-S5.R">figure-S5.R</a> </dt><dd></dd>
<dt> <a href="figure-S6.R">figure-S6.R</a> </dt><dd></dd>
<dt> <a href="figure-S7.R">figure-S7.R</a> </dt><dd></dd>
</dl>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a id="results" name="results"></a> Statistics for Results</h2>
<div class="outline-text-2" id="text-8">
<p>
The following code blocks justify the statistics cited in the main text.
</p>
</div>
