README.org
** Increased mortality explains slow population growth for some heat sensitive strains

 #+BEGIN_QUOTE
 Remarkably, and in contrast with the other two strains we examined,
 the distribution of fecundity among YJM693 cells that survived heat
 stress was identical to that of unstressed cells (Kolmogorov-Smirnov
 test; p = 0.64).
 #+END_QUOTE


 This code runs the KS test to compare the fecundity of live
 stressed cells to unstressed cells.

 #+BEGIN_SRC R :exports both :results value :colnames yes
   source("analyze-two-color-trackscar.R")
   source("analyze-three-color-trackscar.R")

   ## This is what happens when you decide to not use a database
   ## All this does is bring the sundry data frames together
   ## so that they can be compared with one another.

   strains = c(1513, 1523, 1587)

   listOfData = list(
       ## These cells were grown for 6 hr at 37C, then were allowed
       ## to recovery at 30C.
       live35_5 = subset(
               recoveryCounts,
               (growth2 > 0) &
               (strain %in% strains) &
               (temp %in% c("35.5C", "40C")) & # S288C recovery is at 40
               (recoveryTemp == "30C recovery") &
               (recoveryTime == "6 hr recovery"))[,c("growth1", "first", "experiment", "strain")],
       dead35_5 = subset(
               recoveryCounts,
               (growth2 == 0) &
               (strain %in% strains) &
               (temp %in% c("35.5C", "40C")) &
               (recoveryTemp == "30C recovery") &
               (recoveryTime == "6 hr recovery"))[,c("growth1", "first", "experiment", "strain")],
       ## This is the 30C data to compare it to
       noheat = subset(
           heatStressCandidates,
           (strain %in% strains) &
           (temp %in% c("30C"))&
           (growth < 10))[,c("growth", "first", "last", "folder", "strain")]
       )

   liveDeadUnstressed = ldply(
       listOfData,
       function(x){
           if( "growth1" %in% colnames(x)){ # 3 color data
               with(x,
                    data.frame(strain=strain,
                               growth=growth1,
                               first = first,
                               second=first+growth1)
                    )
           }else{ # 2 color data
               with(x, 
                    data.frame(strain = as.numeric(strain),
                               growth=growth,
                               first = first,
                               second = last))}},
       .id = "type") %>%
       subset(!is.na(growth))

   ddply(liveDeadUnstressed,
         .(strain),
         plyr::summarize, 
         p = ks.test(growth[type == "live35_5"],
                     growth[type == "noheat"])$p.value)

   #count(liveDeadUnstressed, c("strain", "type"))
 #+END_SRC

 #+RESULTS:
 | strain |                    p |
 |--------+----------------------|
 |   1513 |    0.637424252607437 |
 |   1523 | 3.33066907387547e-16 |
 |   1587 |                    0 |

 

 
** Fecundity can be positively or negatively associated with age during stress

*** Linear model fecundity p-values

#+BEGIN_QUOTE
At 30°C, average fecundity of cohorts of YJM693 increased
slightly with age, nor whereas the fecundity of cohorts of YJM996 was
not significantly affected by age (Fig. 5a)(linear model, p = 0.016
and p=0.68, respectively).
#+END_QUOTE

#+BEGIN_QUOTE
In contrast, at 35.5°C, replicative age significantly affects the
average fecundity of a cohort in the strains YJM693 and YJM996 (linear
model, p=0.00059 and p=0.00076, respectively).
#+END_QUOTE

#+BEGIN_SRC R :exports both :colnames yes
  source("analyze-linear-models.R")

  ## This just prints the p-value associated with the t-test of the
  ## significance of the slope
   lmSummaries %>% 
      subset(var == "first") %>% 
      dcast( strain ~ temp, value.var = "Pr...t..") %>%
      plyr::summarize(
      strain,
      `30C` = round(`30C`, 5),
      `35.5C` = round(`35.5C`, 5))
#+END_SRC

#+RESULTS:
| strain |     30C |   35.5C |
|--------+---------+---------|
|   1513 | 0.01564 | 0.00059 |
|   1523 | 0.68425 | 0.00076 |
|   1587 | 0.07558 | 0.57134 |

#+BEGIN_QUOTE
The average fecundity of a cohort of S288C was not affected by its age
at any temperature (Fig. S5).
#+END_QUOTE

#+BEGIN_SRC R :exports both :colnames yes
source("analyze-linear-models.R")

## This just prints the p-value associated with the t-test of the
## significance of the slope
lmSummaries2 <- ldply(lm2,
                      function(x){
                          out <- summary(x)$coefficients
                          data.frame( var = c("intercept", "first"), out)
                      }) %>%
    subset(var == "first") %>% 
    plyr::summarize(temp, `p` = round(`Pr...t..`, 5))
#+END_SRC

#+RESULTS:
| temp |       p |
|------+---------|
|   30 | 0.92532 |
| 35.5 |  0.9974 |
|   37 | 0.55688 |
| 38.5 | 0.59948 |
|   40 | 0.59471 |

