README.html

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Increased mortality explains slow population growth for some heat sensitive strains</h3>
<div class="outline-text-3" id="text-8-1">
<blockquote>
<p>
Remarkably, and in contrast with the other two strains we examined,
the distribution of fecundity among YJM693 cells that survived heat
stress was identical to that of unstressed cells (Kolmogorov-Smirnov
test; p = 0.64).
</p>
</blockquote>


<p>
This code runs the KS test to compare the fecundity of live
stressed cells to unstressed cells.
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)
<span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-three-color-trackscar.R"</span>)

<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">This is what happens when you decide to not use a database</span>
<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">All this does is bring the sundry data frames together</span>
<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">so that they can be compared with one another.</span>

strains = c(1513, 1523, 1587)

listOfData = list(
    <span style="color: #6abd50;">## </span><span style="color: #6aaf50;">These cells were grown for 6 hr at 37C, then were allowed</span>
    <span style="color: #6abd50;">## </span><span style="color: #6aaf50;">to recovery at 30C.</span>
    live35_5 = subset(
            recoveryCounts,
            (growth2 &gt; 0) &amp;
            (strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% strains) &amp;
            (temp %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(<span style="color: #CC5542;">"35.5C"</span>, <span style="color: #CC5542;">"40C"</span>)) &amp; <span style="color: #6abd50;"># </span><span style="color: #6aaf50;">S288C recovery is at 40</span>
            (recoveryTemp == <span style="color: #CC5542;">"30C recovery"</span>) &amp;
            (recoveryTime == <span style="color: #CC5542;">"6 hr recovery"</span>))[,c(<span style="color: #CC5542;">"growth1"</span>, <span style="color: #CC5542;">"first"</span>, <span style="color: #CC5542;">"experiment"</span>, <span style="color: #CC5542;">"strain"</span>)],
    dead35_5 = subset(
            recoveryCounts,
            (growth2 == 0) &amp;
            (strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% strains) &amp;
            (temp %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(<span style="color: #CC5542;">"35.5C"</span>, <span style="color: #CC5542;">"40C"</span>)) &amp;
            (recoveryTemp == <span style="color: #CC5542;">"30C recovery"</span>) &amp;
            (recoveryTime == <span style="color: #CC5542;">"6 hr recovery"</span>))[,c(<span style="color: #CC5542;">"growth1"</span>, <span style="color: #CC5542;">"first"</span>, <span style="color: #CC5542;">"experiment"</span>, <span style="color: #CC5542;">"strain"</span>)],
    <span style="color: #6abd50;">## </span><span style="color: #6aaf50;">This is the 30C data to compare it to</span>
    noheat = subset(
        heatStressCandidates,
        (strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% strains) &amp;
        (temp %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(<span style="color: #CC5542;">"30C"</span>))&amp;
        (growth &lt; 10))[,c(<span style="color: #CC5542;">"growth"</span>, <span style="color: #CC5542;">"first"</span>, <span style="color: #CC5542;">"last"</span>, <span style="color: #CC5542;">"folder"</span>, <span style="color: #CC5542;">"strain"</span>)]
    )

liveDeadUnstressed = ldply(
    listOfData,
    <span style="color: #7d7c61; font-weight: bold;">function</span>(x){
        <span style="color: #7d7c61; font-weight: bold;">if</span>( <span style="color: #CC5542;">"growth1"</span> %<span style="color: #7d7c61; font-weight: bold;">in</span>% colnames(x)){ <span style="color: #6abd50;"># </span><span style="color: #6aaf50;">3 color data</span>
            with(x,
                 data.frame(strain=strain,
                            growth=growth1,
                            first = first,
                            second=first+growth1)
                 )
        }<span style="color: #7d7c61; font-weight: bold;">else</span>{ <span style="color: #6abd50;"># </span><span style="color: #6aaf50;">2 color data</span>
            with(x, 
                 data.frame(strain = as.numeric(strain),
                            growth=growth,
                            first = first,
                            second = last))}},
    .id = <span style="color: #CC5542;">"type"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(!is.na(growth))

ddply(liveDeadUnstressed,
      .(strain),
      plyr::summarize, 
      p = ks.test(growth[type == <span style="color: #CC5542;">"live35_5"</span>],
                  growth[type == <span style="color: #CC5542;">"noheat"</span>])$p.value)

<span style="color: #6abd50;">##</span><span style="color: #6aaf50;">count(liveDeadUnstressed, c("strain", "type"))</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">strain</th>
<th scope="col" class="right">p</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1513</td>
<td class="right">0.637424252607437</td>
</tr>

<tr>
<td class="right">1523</td>
<td class="right">3.33066907387547e-16</td>
</tr>

<tr>
<td class="right">1587</td>
<td class="right">0</td>
</tr>
</tbody>
</table>
</div>
</div>




<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Fecundity can be positively or negatively associated with age during stress</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> Linear model fecundity p-values</h4>
<div class="outline-text-4" id="text-8-2-1">
<blockquote>
<p>
At 30°C, average fecundity of cohorts of YJM693 increased
slightly with age, nor whereas the fecundity of cohorts of YJM996 was
not significantly affected by age (Fig. 5a)(linear model, p = 0.016
and p=0.68, respectively).
</p>
</blockquote>

<blockquote>
<p>
In contrast, at 35.5°C, replicative age significantly affects the
average fecundity of a cohort in the strains YJM693 and YJM996 (linear
model, p=0.00059 and p=0.00076, respectively).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-linear-models.R"</span>)

<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">This just prints the p-value associated with the t-test of the</span>
<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">significance of the slope</span>
 lmSummaries <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    subset(var == <span style="color: #CC5542;">"first"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    dcast( strain ~ temp, value.var = <span style="color: #CC5542;">"Pr...t.."</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    plyr::summarize(
    strain,
    <span style="color: #CC5542;">`30C`</span> = round(<span style="color: #CC5542;">`30C`</span>, 5),
    <span style="color: #CC5542;">`35.5C`</span> = round(<span style="color: #CC5542;">`35.5C`</span>, 5))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">strain</th>
<th scope="col" class="right">30C</th>
<th scope="col" class="right">35.5C</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1513</td>
<td class="right">0.01564</td>
<td class="right">0.00059</td>
</tr>

<tr>
<td class="right">1523</td>
<td class="right">0.68425</td>
<td class="right">0.00076</td>
</tr>

<tr>
<td class="right">1587</td>
<td class="right">0.07558</td>
<td class="right">0.57134</td>
</tr>
</tbody>
</table>

<blockquote>
<p>
The average fecundity of a cohort of S288C was not affected by its age
at any temperature (Fig. S5).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-linear-models.R"</span>)

<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">This just prints the p-value associated with the t-test of the</span>
<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">significance of the slope</span>
lmSummaries2 <span style="color: #6a7550;">&lt;-</span> ldply(lm2,
                      <span style="color: #7d7c61; font-weight: bold;">function</span>(x){
                          out <span style="color: #6a7550;">&lt;-</span> summary(x)$coefficients
                          data.frame( var = c(<span style="color: #CC5542;">"intercept"</span>, <span style="color: #CC5542;">"first"</span>), out)
                      }) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(var == <span style="color: #CC5542;">"first"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    plyr::summarize(temp, <span style="color: #CC5542;">`p`</span> = round(<span style="color: #CC5542;">`Pr...t..`</span>, 5))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">temp</th>
<th scope="col" class="right">p</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">30</td>
<td class="right">0.92532</td>
</tr>

<tr>
<td class="right">35.5</td>
<td class="right">0.9974</td>
</tr>

<tr>
<td class="right">37</td>
<td class="right">0.55688</td>
</tr>

<tr>
<td class="right">38.5</td>
<td class="right">0.59948</td>
</tr>

<tr>
<td class="right">40</td>
<td class="right">0.59471</td>
</tr>
</tbody>
</table>
</div>
</div>
