README.org
*** Linear model fecundity slopes

#+BEGIN_QUOTE
Interestingly, while YJM693 cells produce an average of 0.21 ± 0.12
fewer daughters in six hours per cohort when heat stressed, YJM996
cells produce an average of 0.33 ± 0.17 more daughters in six hours
per cohort (intervals are 95% confidence intervals of the
mean)(Fig. 5a).
#+END_QUOTE


This is the estimate of the relationship between the age and fecundity

#+BEGIN_SRC R :exports both :colnames yes
  source("analyze-linear-models.R")
  lmSummaries %>% 
      subset(var == "first") %>% 
      dcast( strain ~ temp, value.var = "Estimate")  %>%
      plyr::summarize(
         strain,
         `30C` = round(`30C`, 3),
         `35.5C` = round(`35.5C`, 3))
#+end_src

#+RESULTS:
| strain |    30C |  35.5C |
|--------+--------+--------|
|   1513 |    0.1 | -0.218 |
|   1523 |  0.041 |  0.334 |
|   1587 | -0.085 | -0.021 |

#+begin_src R :results value :colnames yes
  source("analyze-linear-models.R")
  lmSummaries %>% 
      subset(var == "first") %>% 
      dcast( strain ~ temp, value.var = "Std..Error")  %>%
      plyr::summarize(
         strain,
         `30C` = round(`30C` * 1.98, 3),
         `35.5C` = round(`35.5C` * 1.98, 3))
#+end_src

#+RESULTS:
| strain |   30C | 35.5C |
|--------+-------+-------|
|   1513 | 0.073 | 0.118 |
|   1523 | 0.196 | 0.172 |
|   1587 | 0.088 | 0.071 |


** Heat stress can cause premature senescence or early life mortality

*** Probability of death with age in YJM693

#+BEGIN_QUOTE
Using logistic regression, we estimate that there is a 20% (95%
CI ± 6%) increase in the probability of death for each additional
unit of replicative age in this strain during heat stress.
#+END_QUOTE

#+BEGIN_SRC R :exports both :results output
  source("analyze-two-color-trackscar.R")

  mortality1513 <- heatStressCandidatesWithAge %>%
      subset(strain %in% c(1513)) %>%
      subset(temp == "35.5C") %>%
      transform(dead = ifelse(growth < 4, 1, 0)) %>%
      glm(dead~first, data = .,  family="binomial")
  
  cat("Summary of regression:\n\n")
  summary(mortality1513)
  cat("oConfidence intervals:\n\n")
  confint(mortality1513)
#+END_SRC

#+RESULTS:
#+begin_example
Summary of regression:


Call:
glm(formula = dead ~ first, family = "binomial", data = .)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-1.6922  -0.9423  -0.8705   1.3461   1.5192  

Coefficients:
            Estimate Std. Error z value Pr(>|z|)    
(Intercept) -0.96851    0.07827 -12.373  < 2e-16 ***
first        0.19339    0.02436   7.938 2.06e-15 ***
---
Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 2860.2  on 2144  degrees of freedom
Residual deviance: 2795.5  on 2143  degrees of freedom
AIC: 2799.5

Number of Fisher Scoring iterations: 4

oConfidence intervals:

                 2.5 %     97.5 %
(Intercept) -1.1228875 -0.8159817
first        0.1458738  0.2414310
#+end_example

Since the parameter estimates are log-odds, we exponentiate to get the
odds. The estimate of the increase in mortality is 21%:

#+BEGIN_SRC R :exports both

exp(0.19339)

#+END_SRC

#+RESULTS:
: 1.21335591006032

95% confidence interval width:

#+BEGIN_SRC R :exports both

exp(0.18319339) - exp(0.131458738)

#+END_SRC

#+RESULTS:
: 0.0605558082175794

* <<supp>> Statistics for Supplementary results
  
The following code blocks justify the statistics cited in the supplement.

