README.html

<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> Linear model fecundity slopes</h4>
<div class="outline-text-4" id="text-8-2-2">
<blockquote>
<p>
Interestingly, while YJM693 cells produce an average of 0.21 ± 0.12
fewer daughters in six hours per cohort when heat stressed, YJM996
cells produce an average of 0.33 ± 0.17 more daughters in six hours
per cohort (intervals are 95% confidence intervals of the
mean)(Fig. 5a).
</p>
</blockquote>


<p>
This is the estimate of the relationship between the age and fecundity
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-linear-models.R"</span>)
lmSummaries <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    subset(var == <span style="color: #CC5542;">"first"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    dcast( strain ~ temp, value.var = <span style="color: #CC5542;">"Estimate"</span>)  <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    plyr::summarize(
       strain,
       <span style="color: #CC5542;">`30C`</span> = round(<span style="color: #CC5542;">`30C`</span>, 3),
       <span style="color: #CC5542;">`35.5C`</span> = round(<span style="color: #CC5542;">`35.5C`</span>, 3))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">strain</th>
<th scope="col" class="right">30C</th>
<th scope="col" class="right">35.5C</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1513</td>
<td class="right">0.1</td>
<td class="right">-0.218</td>
</tr>

<tr>
<td class="right">1523</td>
<td class="right">0.041</td>
<td class="right">0.334</td>
</tr>

<tr>
<td class="right">1587</td>
<td class="right">-0.085</td>
<td class="right">-0.021</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-linear-models.R"</span>)
lmSummaries <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    subset(var == <span style="color: #CC5542;">"first"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    dcast( strain ~ temp, value.var = <span style="color: #CC5542;">"Std..Error"</span>)  <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    plyr::summarize(
       strain,
       <span style="color: #CC5542;">`30C`</span> = round(<span style="color: #CC5542;">`30C`</span> * 1.98, 3),
       <span style="color: #CC5542;">`35.5C`</span> = round(<span style="color: #CC5542;">`35.5C`</span> * 1.98, 3))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Heat stress can cause premature senescence or early life mortality</h3>
<div class="outline-text-3" id="text-8-3">
</div><div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> Probability of death with age in YJM693</h4>
<div class="outline-text-4" id="text-8-3-1">
<blockquote>
<p>
Using logistic regression, we estimate that there is a 20% (95%
CI ± 6%) increase in the probability of death for each additional
unit of replicative age in this strain during heat stress.
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)

mortality1513 <span style="color: #6a7550;">&lt;-</span> heatStressCandidatesWithAge <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(1513)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(temp == <span style="color: #CC5542;">"35.5C"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(dead = ifelse(growth &lt; 4, 1, 0)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    glm(dead~first, data = .,  family=<span style="color: #CC5542;">"binomial"</span>)

cat(<span style="color: #CC5542;">"Summary of regression:\n\n"</span>)
summary(mortality1513)
cat(<span style="color: #CC5542;">"oConfidence intervals:\n\n"</span>)
confint(mortality1513)
</pre>
</div>

<pre class="example">
Summary of regression:


Call:
glm(formula = dead ~ first, family = "binomial", data = .)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-1.6922  -0.9423  -0.8705   1.3461   1.5192  

Coefficients:
            Estimate Std. Error z value Pr(&gt;|z|)    
(Intercept) -0.96851    0.07827 -12.373  &lt; 2e-16 ***
first        0.19339    0.02436   7.938 2.06e-15 ***
---
Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 2860.2  on 2144  degrees of freedom
Residual deviance: 2795.5  on 2143  degrees of freedom
AIC: 2799.5

Number of Fisher Scoring iterations: 4

oConfidence intervals:

                 2.5 %     97.5 %
(Intercept) -1.1228875 -0.8159817
first        0.1458738  0.2414310
</pre>

<p>
Since the parameter estimates are log-odds, we exponentiate to get the
odds. The estimate of the increase in mortality is 21%:
</p>

<div class="org-src-container">

<pre class="src src-R">exp(0.19339)
</pre>
</div>

<pre class="example">
1.21335591006032
</pre>

<p>
95% confidence interval width:
</p>

<div class="org-src-container">

<pre class="src src-R">exp(0.18319339) - exp(0.131458738)
</pre>
</div>

<pre class="example">
0.0605558082175794
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a id="supp" name="supp"></a> Statistics for Supplementary results</h2>
<div class="outline-text-2" id="text-9">
<p>
The following code blocks justify the statistics cited in the supplement.
</p>
</div>
