README.org
** Trackscar minimally affects cellular physiology

 #+BEGIN_QUOTE
 Using TrackScar we estimated the average division time to be 73.9
 minutes for haploid cells of the genomic reference strain S288c grown
 in rich-media conditions.
 #+END_QUOTE

 The approach here is to fit a linear regression to the number of buds
 added for this timeseries.

 #+BEGIN_SRC R :exports both :colnames yes
   source("load-libraries.R")
   timeseriesCounts <- read.csv("2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv")
   ## Note that CMY1 is the S288C genomic reference strain and is haploid
   timeseriesCounts %>%
       subset(strain == "CMY1") %>% 
       lm(growth~time, data=.) %>%
       summary %>% 
       plyr::summarize(
           hours = round(60*(1/coefficients[2,1]),1),
           sderr = round(coefficients[2,2],3))
 #+END_SRC

 #+RESULTS:
 | hours | sderr |
 |-------+-------|
 |  73.9 | 0.029 |


 #+BEGIN_QUOTE
 We found no evidence that reproductive rates at earlier time points
 were any lower than later time points (Fig. S1a). Indeed, our data
 show that cells at time points immediately following the first stain
 produce slightly more daughters than those at later time points
 (linear model; p = 0.03).
 #+END_QUOTE

 #+BEGIN_SRC R :exports both :results output
   source("load-libraries.R")
   timeseriesCounts <- read.csv("2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv")

   meanByTime <- ddply(timeseriesCounts,
                       .(strain, time),
                       plyr::summarize,
                       m = mean(growth, na.rm=T)) %>%
       ddply(.(strain),
             plyr::mutate,
             change = c( m[1], m[2:length(m)]-m[1:(length(m)-1)]),
             interval = c( time[1], time[2:length(m)]-time[1:(length(m)-1)]),
             time) %>%
       transform(rate = change/interval)

   meanByTime %>% 
       subset((interval <=6)) %>%
       lm(rate~time, data = .) %>%
       summary()
 #+END_SRC

 #+RESULTS:
 #+begin_example

 Call:
 lm(formula = rate ~ time, data = .)

 Residuals:
      Min       1Q   Median       3Q      Max 
 -0.68058 -0.15459  0.00655  0.12647  0.56621 

 Coefficients:
	     Estimate Std. Error t value Pr(>|t|)    
 (Intercept)  0.99236    0.07831  12.673   <2e-16 ***
 time        -0.04006    0.01791  -2.237   0.0292 *  
 ---
 Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

 Residual standard error: 0.2697 on 58 degrees of freedom
 Multiple R-squared:  0.07941,	Adjusted R-squared:  0.06354 
 F-statistic: 5.003 on 1 and 58 DF,  p-value: 0.02916

#+end_example

** TrackScar provides a sensitive measure of differences in fecundity

 #+BEGIN_QUOTE
 This difference is significant (Paired t-test; n=3; p = 0.030). Consistent with this expectation, daughter cells of haploid strain
 S288C produced an average of 4.9 daughters in a six-hour period,
 whereas mother cells produced an average of 5.4 daughters (Fig. S1b).
 #+END_QUOTE

 #+BEGIN_SRC R :exports both :results output
   source("analyze-two-color-trackscar.R")

   heatStressCandidatesWithAge <- read.csv("2016-Maxwell-Magwene-two-color-trackscar.csv", as.is=T)

   fig1Means <- haploidCounts %>% 
       subset((first %in% c(1,2)))%>% # restrict to 1 & 2 bud old cells
           subset(!is.na(growth)) %>% 
           transform(
               group=factor(first,
                   labels = c(1,2))
               ) %>%
         ddply(
           c("folder", "group"),
           plyr::summarize,
           mean=mean(growth)) %>%
         dcast(folder~group, value.var = "mean")


   cat("*** Daughter mean:\n")
   mean(fig1Means[["1"]])

   cat("*** One bud mean:\n")
   mean(fig1Means[["2"]])

   cat("*** T-test\n")
   with( fig1Means,
	t.test( `1`, `2`,paired=TRUE))
 #+END_SRC

 #+RESULTS:
 #+begin_example
 *** Daughter mean:
 [1] 4.912125
 *** One bud mean:
 [1] 5.420181
 *** T-test

	 Paired t-test

 data:  1 and 2
 t = -5.5597, df = 2, p-value = 0.03086
 alternative hypothesis: true difference in means is not equal to 0
 95 percent confidence interval:
  -0.9012408 -0.1148706
 sample estimates:
 mean of the differences 
	      -0.5080557 

#+end_example

** Population Growth Rate and Mean Fecundity Are Well Correlated

 #+BEGIN_QUOTE
 The average fecundity of cells measured using TrackScar and the
 maximum population growth rate measured by optical density at 35.5C
 are well-correlated (r^2=0.58; Fig. S2).
 #+END_QUOTE

 #+BEGIN_SRC R :exports both :results output
 source("analyze-two-color-trackscar.R")
 with(subset(candidateGrowth, !is.na(mean_35_5C)),
      cor(mean_35_5C, maxGrowth35halfC))^2
 #+END_SRC

 #+RESULTS:
 : [1] 0.5754468

