README.html

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Trackscar minimally affects cellular physiology</h3>
<div class="outline-text-3" id="text-9-1">
<blockquote>
<p>
Using TrackScar we estimated the average division time to be 73.9
minutes for haploid cells of the genomic reference strain S288c grown
in rich-media conditions.
</p>
</blockquote>

<p>
The approach here is to fit a linear regression to the number of buds
added for this timeseries.
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)
timeseriesCounts <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv"</span>)
<span style="color: #6abd50;">## </span><span style="color: #6aaf50;">Note that CMY1 is the S288C genomic reference strain and is haploid</span>
timeseriesCounts <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    subset(strain == <span style="color: #CC5542;">"CMY1"</span>) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    lm(growth~time, data=.) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    summary <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    plyr::summarize(
        hours = round(60*(1/coefficients[2,1]),1),
        sderr = round(coefficients[2,2],3))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">hours</th>
<th scope="col" class="right">sderr</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">73.9</td>
<td class="right">0.029</td>
</tr>
</tbody>
</table>


<blockquote>
<p>
We found no evidence that reproductive rates at earlier time points
were any lower than later time points (Fig. S1a). Indeed, our data
show that cells at time points immediately following the first stain
produce slightly more daughters than those at later time points
(linear model; p = 0.03).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)
timeseriesCounts <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2016-Maxwell-Magwene-two-color-trackscar-timeseries.csv"</span>)

meanByTime <span style="color: #6a7550;">&lt;-</span> ddply(timeseriesCounts,
                    .(strain, time),
                    plyr::summarize,
                    m = mean(growth, na.rm=T)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    ddply(.(strain),
          plyr::mutate,
          change = c( m[1], m[2:length(m)]-m[1:(length(m)-1)]),
          interval = c( time[1], time[2:length(m)]-time[1:(length(m)-1)]),
          time) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(rate = change/interval)

meanByTime <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    subset((interval &lt;=6)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    lm(rate~time, data = .) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    summary()
</pre>
</div>

<pre class="example">
Call:
lm(formula = rate ~ time, data = .)

Residuals:
     Min       1Q   Median       3Q      Max 
-0.68058 -0.15459  0.00655  0.12647  0.56621 

Coefficients:
	    Estimate Std. Error t value Pr(&gt;|t|)    
(Intercept)  0.99236    0.07831  12.673   &lt;2e-16 ***
time        -0.04006    0.01791  -2.237   0.0292 *  
---
Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1

Residual standard error: 0.2697 on 58 degrees of freedom
Multiple R-squared:  0.07941,	Adjusted R-squared:  0.06354 
F-statistic: 5.003 on 1 and 58 DF,  p-value: 0.02916
</pre>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> TrackScar provides a sensitive measure of differences in fecundity</h3>
<div class="outline-text-3" id="text-9-2">
<blockquote>
<p>
This difference is significant (Paired t-test; n=3; p = 0.030). Consistent with this expectation, daughter cells of haploid strain
S288C produced an average of 4.9 daughters in a six-hour period,
whereas mother cells produced an average of 5.4 daughters (Fig. S1b).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)

heatStressCandidatesWithAge <span style="color: #6a7550;">&lt;-</span> read.csv(<span style="color: #CC5542;">"2016-Maxwell-Magwene-two-color-trackscar.csv"</span>, as.is=T)

fig1Means <span style="color: #6a7550;">&lt;-</span> haploidCounts <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    subset((first %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(1,2)))<span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> <span style="color: #6abd50;"># </span><span style="color: #6aaf50;">restrict to 1 &amp; 2 bud old cells</span>
        subset(!is.na(growth)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
        transform(
            group=factor(first,
                labels = c(1,2))
            ) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
      ddply(
        c(<span style="color: #CC5542;">"folder"</span>, <span style="color: #CC5542;">"group"</span>),
        plyr::summarize,
        mean=mean(growth)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
      dcast(folder~group, value.var = <span style="color: #CC5542;">"mean"</span>)


cat(<span style="color: #CC5542;">"*** Daughter mean:\n"</span>)
mean(fig1Means[[<span style="color: #CC5542;">"1"</span>]])

cat(<span style="color: #CC5542;">"*** One bud mean:\n"</span>)
mean(fig1Means[[<span style="color: #CC5542;">"2"</span>]])

cat(<span style="color: #CC5542;">"*** T-test\n"</span>)
with( fig1Means,
     t.test( <span style="color: #CC5542;">`1`</span>, <span style="color: #CC5542;">`2`</span>,paired=<span style="color: #528fd1;">TRUE</span>))
</pre>
</div>

<pre class="example">
*** Daughter mean:
[1] 4.912125
*** One bud mean:
[1] 5.420181
*** T-test

	Paired t-test

data:  1 and 2
t = -5.5597, df = 2, p-value = 0.03086
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.9012408 -0.1148706
sample estimates:
mean of the differences 
	     -0.5080557
</pre>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Population Growth Rate and Mean Fecundity Are Well Correlated</h3>
<div class="outline-text-3" id="text-9-3">
<blockquote>
<p>
The average fecundity of cells measured using TrackScar and the
maximum population growth rate measured by optical density at 35.5C
are well-correlated (r<sup>2</sup>=0.58; Fig. S2).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)
with(subset(candidateGrowth, !is.na(mean_35_5C)),
     cor(mean_35_5C, maxGrowth35halfC))^2
</pre>
</div>

<pre class="example">
[1] 0.5754468
</pre>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)
candidateGrowth <span style="color: #6a7550;">&lt;-</span>
    subset(candidateGrowth, !is.na(mean_35_5C)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(sensitive = ratioMaxGrowth &lt; 0.93)
print(<span style="color: #CC5542;">"Total correlation"</span>)
with(candidateGrowth,
     cor(mean_35_5C, maxGrowth35halfC))^2
print(<span style="color: #CC5542;">"Robust strains correlation"</span>)
with(subset(candidateGrowth, !sensitive),
     cor(mean_35_5C, maxGrowth35halfC))^2
print(<span style="color: #CC5542;">"Sensitive strains correlation"</span>)
with(subset(candidateGrowth, sensitive),
     cor(mean_35_5C, maxGrowth35halfC))^2
</pre>
</div>


<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)
candidateGrowth <span style="color: #6a7550;">&lt;-</span>
    subset(candidateGrowth, !is.na(mean_35_5C)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span>
    transform(sensitive = ratioMaxGrowth &lt; 0.93)

model0 = lm(mean_35_5C~maxGrowth35halfC, data = candidateGrowth)
model1 = lm(mean_35_5C~sensitive+maxGrowth35halfC, data = candidateGrowth)
model2 = lm(mean_35_5C~sensitive*maxGrowth35halfC, data = candidateGrowth)

anova(model0, model2, test=<span style="color: #CC5542;">"Chisq"</span>)
anova(model0, model1, test=<span style="color: #CC5542;">"Chisq"</span>)
</pre>
</div>
</div>
</div>
