README.org
** Heat stress can alter the distribution of ages in a population

#+BEGIN_QUOTE
 Furthermore, neither YJM693 nor S288C showed significantly different
 age distributions at 30°C and 35.5°C (Kolmogorov-Smirnov test,
 p>0.3). However, YJM996 had a significantly different distribution of
 ages during growth at 35.5°C (Kolmogorov-Smirnov test, p=1.50×〖10〗
 ^(-9)). . Furthermore, neither YJM693 nor S288C showed significantly
 different age distributions at 30°C and 35.5°C (Kolmogorov-Smirnov
 test, p>0.3). However, YJM996 had a significantly different
 distribution of ages during growth at 35.5°C (Kolmogorov-Smirnov test,
 p=1.74×〖10〗^(-7)).
#+END_QUOTE

#+BEGIN_SRC R :exports both :results output
  source("analyze-two-color-trackscar.R")

  subset( heatStressCandidates, 
         strain %in% c(1587, 1513, 1523)) %>% 
      dlply(.(strain), with, 
            ks.test(first[temp == "30C"], first[temp == "35.5C"]))
#+END_SRC

#+RESULTS:
#+begin_example
$`1513`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.042929, p-value = 0.2773
alternative hypothesis: two-sided


$`1523`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.16369, p-value = 1.737e-07
alternative hypothesis: two-sided


$`1587`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.042596, p-value = 0.6035
alternative hypothesis: two-sided


attr(,"split_type")
[1] "data.frame"
attr(,"split_labels")
  strain
1   1513
2   1523
3   1587
#+end_example

* <<session>> Session Info

#+BEGIN_SRC R :exports both :results output
  source("load-libraries.R")
  sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 3.2.3 (2015-12-10)
Platform: x86_64-apple-darwin13.4.0 (64-bit)
Running under: OS X 10.10.5 (Yosemite)

locale:
[1] C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] cellGrowth_1.14.0 locfit_1.5-9.1    gridExtra_2.2.1   scales_0.4.0     
[5] wesanderson_0.3.2 reshape2_1.4.1    plyr_1.8.3        magrittr_1.5     
[9] ggplot2_2.1.0    

loaded via a namespace (and not attached):
[1] Rcpp_0.12.4      lattice_0.20-33  grid_3.2.3       gtable_0.2.0    
[5] stringi_1.0-1    tools_3.2.3      stringr_1.0.0    munsell_0.4.3   
[9] colorspace_1.2-6
#+end_example

