README.html

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Heat stress can alter the distribution of ages in a population</h3>
<div class="outline-text-3" id="text-9-4">
<blockquote>
<p>
Furthermore, neither YJM693 nor S288C showed significantly different
age distributions at 30°C and 35.5°C (Kolmogorov-Smirnov test,
p&gt;0.3). However, YJM996 had a significantly different distribution of
ages during growth at 35.5°C (Kolmogorov-Smirnov test, p=1.50×〖10〗
^(-9)). . Furthermore, neither YJM693 nor S288C showed significantly
different age distributions at 30°C and 35.5°C (Kolmogorov-Smirnov
test, p&gt;0.3). However, YJM996 had a significantly different
distribution of ages during growth at 35.5°C (Kolmogorov-Smirnov test,
p=1.74×〖10〗<sup>(-7)</sup>).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"analyze-two-color-trackscar.R"</span>)

subset( heatStressCandidates, 
       strain %<span style="color: #7d7c61; font-weight: bold;">in</span>% c(1587, 1513, 1523)) <span style="color: #bdbdb3; font-weight: bold;">%&gt;%</span> 
    dlply(.(strain), with, 
          ks.test(first[temp == <span style="color: #CC5542;">"30C"</span>], first[temp == <span style="color: #CC5542;">"35.5C"</span>]))
</pre>
</div>

<pre class="example">
$`1513`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.042929, p-value = 0.2773
alternative hypothesis: two-sided


$`1523`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.16369, p-value = 1.737e-07
alternative hypothesis: two-sided


$`1587`

	Two-sample Kolmogorov-Smirnov test

data:  first[temp == "30C"] and first[temp == "35.5C"]
D = 0.042596, p-value = 0.6035
alternative hypothesis: two-sided


attr(,"split_type")
[1] "data.frame"
attr(,"split_labels")
  strain
1   1513
2   1523
3   1587
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a id="session" name="session"></a> Session Info</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #6a7550;">source</span>(<span style="color: #CC5542;">"load-libraries.R"</span>)
sessionInfo()
</pre>
</div>

<pre class="example">
R version 3.2.3 (2015-12-10)
Platform: x86_64-apple-darwin13.4.0 (64-bit)
Running under: OS X 10.10.5 (Yosemite)

locale:
[1] C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] cellGrowth_1.14.0 locfit_1.5-9.1    gridExtra_2.2.1   scales_0.4.0     
[5] wesanderson_0.3.2 reshape2_1.4.1    plyr_1.8.3        magrittr_1.5     
[9] ggplot2_2.1.0    

loaded via a namespace (and not attached):
[1] Rcpp_0.12.4      lattice_0.20-33  grid_3.2.3       gtable_0.2.0    
[5] stringi_1.0-1    tools_3.2.3      stringr_1.0.0    munsell_0.4.3   
[9] colorspace_1.2-6
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: June 2016</p>
<p class="author">Author: Colin S Maxwell and Paul M Magwene</p>
<p class="date">Created: 2016-11-27 Sun 14:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
